Notes/daily/2021-11-01.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>2021-11-01</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" href="/simple.min.css" /><link rel="stylesheet" href="/custom.css" />
</head>
<body>
<div id="preamble" class="status">

<div class="header">
    <span class="title">2021-11-01</span>
    <div class="links">
        <a href="/">Home</a>
        <a href="/Notes/daily/2021-11-03.html">Latest daily</a>
        <a href="https://github.com/Minion3665/EPQ/issues/new">Report issue</a>
        <a href="https://github.com/Minion3665/EPQ">View source</a>
    </div>
</div>
</div>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orge110df5">EPQ lesson notes (1h5m)</a></li>
</ul>
</div>
</div>
<div id="outline-container-orge110df5" class="outline-2">
<h2 id="orge110df5">EPQ lesson notes (1h5m)</h2>
<div class="outline-text-2" id="text-orge110df5">
<ul class="org-ul">
<li class="on"><code>[X]</code> Creating a project breakdown</li>
</ul>
<p>
A project breakdown is a <a href="https://en.wikipedia.org/wiki/Decomposition_(computer_science)">decomposition</a> of tasks in the project. Issues <a href="https://github.com/Minion3665/EPQ/issues/7">#7</a> to <a href="https://github.com/Minion3665/EPQ/issues/15">#15</a> on github have been created as an in-order decomposition of tasks that will need to be done
</p>

<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> Making a project timeline</li>
</ul>
<p>
The tasks in the breakdown will need to be dated by the month I plan to complete them in, and this will need to be made into a timeline form (presumably using figma)
</p>
</div>
</div>
</div>
</body>
</html>
